---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.NoStructuralHostToAttachWarning
source: html/fbf71cbc-dc30-d600-0046-2e2303e336ea.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.NoStructuralHostToAttachWarning Property

There is no structural component to attach the hanger rod to.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoStructuralHostToAttachWarning { get; }
```